# GetApplicationId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IDirectContext3DServer..::..GetApplicationId Method
IDirectContext3DServer Interface See Also
---
Reports this server's application ID.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
string GetApplicationId()
```

Visual Basic
---
```text
Function GetApplicationId As String
```

Visual C++
---
```text
String^ GetApplicationId()
```

# ### Return Value
The application ID.
# See Also
IDirectContext3DServer Interface
Autodesk.Revit.DB.DirectContext3D Namespace